In [3]:
import pandas as pd

# information about employees
id_number = ['128', '478', '257', '299', '175', '328', '099', '457', '144', '222']
name = ['Patrick', 'Amanda', 'Antonella', 'Eduard', 'John', 'Alejandra', 'Layton', 'Melanie', 'David', 'Lewis']
surname = ['Miller', 'Torres', 'Brown', 'Iglesias', 'Wright', 'Campos', 'Platt', 'Cavill', 'Lange', 'Bellow']
division = ['Sales', 'IT', 'IT', 'Sales', 'Marketing', 'Engineering', 'Engineering', 'Sales', 'Engineering', 'Sales']
salary = [30000, 54000, 80000, 79000, 15000, 18000, 30000, 35000, 45000, 30500]
telephone = ['7366578', '7366444', '7366120', '7366574', '7366113', '7366117', '7366777', '7366579', '7366441', '7366440']
type_contract = ['permanent', 'temporary', 'temporary', 'permanent', 'internship', 'internship', 'permanent', 'temporary', 'permanent', 'permanent']

# data frame containing information about employees
df_employees = pd.DataFrame({'name': name, 'surname': surname, 'division': division,
                             'salary': salary, 'telephone': telephone, 'type_contract': type_contract}, index=id_number)

df_employees

          name   surname     division  salary telephone type_contract
128    Patrick    Miller        Sales   30000   7366578     permanent
478     Amanda    Torres           IT   54000   7366444     temporary
257  Antonella     Brown           IT   80000   7366120     temporary
299     Eduard  Iglesias        Sales   79000   7366574     permanent
175       John    Wright    Marketing   15000   7366113    internship
328  Alejandra    Campos  Engineering   18000   7366117    internship
099     Layton     Platt  Engineering   30000   7366777     permanent
457    Melanie    Cavill        Sales   35000   7366579     temporary
144      David     Lange  Engineering   45000   7366441     permanent
222      Lewis    Bellow        Sales   30500   7366440     permanent

In [7]:
df_employees[['division','salary']]

        division  salary
128        Sales   30000
478           IT   54000
257           IT   80000
299        Sales   79000
175    Marketing   15000
328  Engineering   18000
099  Engineering   30000
457        Sales   35000
144  Engineering   45000
222        Sales   30500

In [8]:
import numpy as np
df_employees.select_dtypes(include=np.number)

     salary
128   30000
478   54000
257   80000
299   79000
175   15000
328   18000
099   30000
457   35000
144   45000
222   30500

In [10]:
df_employees.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 128 to 222
Data columns (total 6 columns):
name             10 non-null object
surname          10 non-null object
division         10 non-null object
salary           10 non-null int64
telephone        10 non-null object
type_contract    10 non-null object
dtypes: int64(1), object(5)
memory usage: 880.0+ bytes

In [14]:
df_employees.dtypes

name             object
surname          object
division         object
salary            int64
telephone        object
type_contract    object
dtype: object

In [16]:
df_employees.loc[['478','222']]

       name surname division  salary telephone type_contract
478  Amanda  Torres       IT   54000   7366444     temporary
222   Lewis  Bellow    Sales   30500   7366440     permanent

In [19]:
df_employees.iloc[-1]

name                 Lewis
surname             Bellow
division             Sales
salary               30500
telephone          7366440
type_contract    permanent
Name: 222, dtype: object

In [21]:
df_employees.iloc[1,3]

54000

In [24]:
df_employees.loc['478','salary']

54000

In [25]:
df_employees.iloc[[1,3],[0,1,3]]

       name   surname  salary
478  Amanda    Torres   54000
299  Eduard  Iglesias   79000

In [26]:
df_employees.loc[['478','222'],['name','division','salary']]

       name division  salary
478  Amanda       IT   54000
222   Lewis    Sales   30500

In [29]:
%timeit df_employees.at['478', 'salary']
%timeit df_employees.loc['478','salary']

4.67 µs ± 513 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
7.18 µs ± 644 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [31]:
df_employees[(df_employees.salary>45000)&(df_employees.type_contract=='permanent')]

       name   surname division  salary telephone type_contract
299  Eduard  Iglesias    Sales   79000   7366574     permanent

In [32]:
df_employees[(df_employees.type_contract.isin(['permanent','temporary']))]

          name   surname     division  salary telephone type_contract
128    Patrick    Miller        Sales   30000   7366578     permanent
478     Amanda    Torres           IT   54000   7366444     temporary
257  Antonella     Brown           IT   80000   7366120     temporary
299     Eduard  Iglesias        Sales   79000   7366574     permanent
099     Layton     Platt  Engineering   30000   7366777     permanent
457    Melanie    Cavill        Sales   35000   7366579     temporary
144      David     Lange  Engineering   45000   7366441     permanent
222      Lewis    Bellow        Sales   30500   7366440     permanent

In [33]:
%timeit df_employees[(df_employees['type_contract'] == 'temporary') | (df_employees['type_contract'] == 'permanent')]
%timeit df_employees[df_employees['type_contract'].isin(['temporary', 'permanent'])]

1.09 ms ± 116 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)
645 µs ± 116 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [35]:
df_employees[df_employees.salary.between(30000,80000,inclusive=False)]

        name   surname     division  salary telephone type_contract
478   Amanda    Torres           IT   54000   7366444     temporary
299   Eduard  Iglesias        Sales   79000   7366574     permanent
457  Melanie    Cavill        Sales   35000   7366579     temporary
144    David     Lange  Engineering   45000   7366441     permanent
222    Lewis    Bellow        Sales   30500   7366440     permanent

In [40]:
df_employees[(df_employees.salary>30000) & (df_employees.salary<80000)]

        name   surname     division  salary telephone type_contract
478   Amanda    Torres           IT   54000   7366444     temporary
299   Eduard  Iglesias        Sales   79000   7366574     permanent
457  Melanie    Cavill        Sales   35000   7366579     temporary
144    David     Lange  Engineering   45000   7366441     permanent
222    Lewis    Bellow        Sales   30500   7366440     permanent

In [42]:
%timeit df_employees[df_employees.salary.between(30000,80000,inclusive=False)]
%timeit df_employees[(df_employees.salary>30000) & (df_employees.salary<80000)]

1.11 ms ± 142 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)
983 µs ± 21.9 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [48]:
df_employees[df_employees.name.str.startswith('A')]

          name surname     division  salary telephone type_contract
478     Amanda  Torres           IT   54000   7366444     temporary
257  Antonella   Brown           IT   80000   7366120     temporary
328  Alejandra  Campos  Engineering   18000   7366117    internship

In [47]:
df_employees[df_employees.name.str.contains('l')]

          name surname     division  salary telephone type_contract
257  Antonella   Brown           IT   80000   7366120     temporary
328  Alejandra  Campos  Engineering   18000   7366117    internship
457    Melanie  Cavill        Sales   35000   7366579     temporary

In [51]:
df_employees[df_employees.name.str.endswith('e')]

        name surname division  salary telephone type_contract
457  Melanie  Cavill    Sales   35000   7366579     temporary